onec-mid-base-11/src/InformationRegisters/НАШ_СкидкиКонтрагенты/НАШ_СкидкиКонтрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НАШ_СкидкиКонтрагенты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

onec-mid-base-11/src/CommonModules/НАШ_ОбщегоНазначения/Module.bsl
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СкидкаПокупатель(Контрагент,Дата)Экспорт
	
	Запрос = Новый Запрос;
	Запрос. Текст = "ВЫБРАТЬ
	                |	СкидкиПоследние.Контрагент КАК Контрагент,
	                |	ЕСТЬNULL(СкидкиПоследние.Скидка,0) КАК Скидка
	                |ИЗ
	                |	РегистрСведений.НАШ_СкидкиКонтрагенты.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК СкидкиПоследние";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент); 
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата)); 
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Скидка;
	Иначе 	
		Возврат Неопределено;
	КонецЕсли;

КонецФункции	

#КонецОбласти
